app/controllers/api/properties_controller.rb

    def index
        if bounds
            @properties = Property.in_bounds(bounds).in_filters(params)
            if params[:query]
                @properties = @properties.in_query(params[:query])
            end
        else
            Property.all
---
SELECT "properties".* FROM "properties"